#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДанныеОтвета") Тогда
		ДанныеОтвета = Параметры.ДанныеОтвета;
		ПорядковыйНомер = ДанныеОтвета.ПорядковыйНомер;
		Наименование = ДанныеОтвета.Наименование;
		Ответ = ДанныеОтвета.Ответ;
		Правильный = ДанныеОтвета.Правильный;
		Недействителен = ДанныеОтвета.Недействителен;
		Ссылка = ДанныеОтвета.Ссылка;
		ВыбраннаяСтрока = ДанныеОтвета.ВыбраннаяСтрока;
	КонецЕсли;
	Если Параметры.Свойство("СледующийПорядковыйНомер") Тогда
		ПорядковыйНомер = Параметры.СледующийПорядковыйНомер;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	Если Не ОшибкиЗаполнения() Тогда
		ПараметрыПередачи = Новый Структура;
		ПараметрыПередачи.Вставить("ПорядковыйНомер", ПорядковыйНомер);
		ПараметрыПередачи.Вставить("Наименование", Наименование);
		ПараметрыПередачи.Вставить("Ответ", Ответ);
		ПараметрыПередачи.Вставить("Правильный", Правильный);
		ПараметрыПередачи.Вставить("Недействителен", Недействителен);
		ПараметрыПередачи.Вставить("Ссылка", Ссылка);
		ПараметрыПередачи.Вставить("ВыбраннаяСтрока", ВыбраннаяСтрока);
		ПараметрыПередачи.Вставить("ЕстьИзменения", Истина);
		Закрыть(ПараметрыПередачи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОшибкиЗаполнения()
	Результат = Ложь;
	Если Не ЗначениеЗаполнено(ПорядковыйНомер) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Порядковый номер"" не заполнено");
		Результат = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Наименование"" не заполнено");
		Результат = Истина;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Ответ) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Поле ""Ответ"" не заполнено");
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти