
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных
#КонецОбласти
	
#Область ПрограммныйИнтерфейс
#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РезультатыТестирований
	Движения.РезультатыТестирований.Записывать = Истина;
	Для Каждого ТекСтрокаВопросы из Вопросы Цикл
		Движение = Движения.РезультатыТестирований.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Тест = Тест;
		Движение.Вопрос = ТекСтрокаВопросы.Вопрос;
		Движение.Ответ = ТекСтрокаВопросы.Ответ;
		Движение.Правильный = ТекСтрокаВопросы.Правильный;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли